PIPE/STRATEGY_II/CASE/0/theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300.0;
    }

    outlet
    {
        type            zeroGradient;
    }

    "(pipe)"
    {
        type            fixedGradient;
        gradient        uniform 1000.0;
    }

    front
    {   
        type            wedge;
    }
    
    back
    {   
        type            wedge;
    }
    
    axis
    {
        type            empty;
    }

}


// ************************************************************************* //
