PIPE/STRATEGY_II/CASE/system/controlDict
FoamFile
{
	version 2.0;
	format binary;
	class dictionary;
	location "";
	object controlDict;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

application simpleFoam;

startFrom latestTime;

startTime 0.;

stopAt endTime;

endTime	20000;

deltaT 	1.;

writeControl timeStep;

writeInterval	100;

purgeWrite	5;

writeFormat	binary;

writePrecision	6;

writeCompression	off;

timeFormat	general;

timePrecision	6;

graphFormat	raw;

runTimeModifiable	yes;

functions {

   //#includeFunc grad(U)
   //#includeFunc grad(nut)
   //#includeFunc grad(theta)
   //#includeFunc yPlus
   //#includeFunc graphCellFace

}
