PIPE/STRATEGY_II/CASE/system/graphCellFace
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. One graph point is generated on each face and in each cell that
    the line intersects.

\*---------------------------------------------------------------------------*/

start       (198.75161616  10.0 0.);
end         (198.75161616 -10.0 0.);

fields
(
    U
    nut
    nuTilda
    theta
    yPlus
    grad(U)
    grad(nut)
    grad(theta)
);

axis            y;        // The independent variable of the graph. Can be "x",
                          // "y", "z", "xyz" (all coordinates written out), or
                          // "distance" (from the start point).

#includeEtc "caseDicts/postProcessing/graphs/graphCellFace.cfg"

// ************************************************************************* //
